import "./AboutProjects.css";

function AboutProjects() {
    return (
        <div className="aboutProjects">
            <h2>Описание проектов</h2>
            <h3>Змейка</h3>
            <div className="aboutProjects-elements">
                <p>«Зме́йка» (англ. Snake), также «Питон», «Удав», «Червяк» — жанр компьютерных игр, в которых игрок управляет «головой» растущей линии («змеи») и не должен позволять ей столкнуться с препятствиями, в том числе со своим «хвостом». Первые подобные игры возникли в 1970-х годах. Наиболее известна версия от Nokia (Snake, Snake 2, Snake 3, Snake Xenzia), впервые появившаяся в кнопочном телефоне Nokia 6110. Разработана финским разработчиком Танели Арманто.</p>

                <p>Игровой процесс</p>
                <p>Игрок управляет длинным, тонким существом, напоминающим змею, которое ползает по плоскости (как правило, ограниченной стенками), собирая еду (или другие предметы) и избегая столкновения с собственным хвостом и краями игрового поля (существуют варианты, где при прохождении через край змея выходит из противоположного края поля). Каждый раз, когда змея съедает кусок пищи, она становится длиннее, что постепенно усложняет игру[1][2]. В другом варианте двое играют двумя такими змеями так, чтобы вынудить соперника врезаться во что-то.</p>
            </div>
            <h3>Тетрис</h3>
            <div className="aboutProjects-elements">
                <p>Те́трис (производное от «тетрамино» и «теннис»[2] или Xonix[3]) — компьютерная игра, изобретённая и разработанная советским программистом Алексеем Пажитновым. Игра была выпущена в 1985 году — в это время Пажитнов работал в Вычислительном центре Академии наук СССР.</p>
                <p>«Тетрис» представляет собой головоломку, построенную на использовании геометрических фигур «тетрамино» — разновидности полимино, состоящих из четырёх квадратов. Полимино в том или ином виде использовались в настольных играх и головоломках задолго до создания «Тетриса». Идею «Тетриса» Пажитнову подсказала игра в пентамино[4]. Первоначальная версия игры была написана Пажитновым на языке программирования Паскаль[5][6] для компьютера «Электроника-60». Коммерческая версия игры — первая из многих последующих — была выпущена американской компанией Spectrum HoloByte в 1987 году. В последующие годы «Тетрис» во множестве различных версий был портирован на великое множество устройств, включая всевозможные компьютеры и игровые консоли, а также такие устройства, как графические калькуляторы, мобильные телефоны, медиаплееры, карманные персональные компьютеры и — в качестве «пасхального яйца» — устройства, вовсе не предназначенные для воспроизведения медиаконтента, такие, как паяльник[7].</p>
            </div>
        </div>
    )
}

export default AboutProjects;